docs/fileing files/ECF Operations/ReviewFiling/eFiling Baseline Courts/Family Law/Subsequent Filing/First Paper - Response with request for order using custody or visitation flag Sample.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://niem.gov/niem/niem-core/2.0" xmlns:ns10="urn:com.journaltech:ecourt:ecf:extension:ContactValue" xmlns:ns11="urn:com.journaltech:ecourt:ecf:extension:CoreFilingMessageExtType" xmlns:ns12="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:PaymentMessage-4.0" xmlns:ns13="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2" xmlns:ns14="urn:com.journaltech:ecourt:ecf:extension:PaymentMessageExt" xmlns:ns15="urn:oasis:names:tc:legalxml-courtfiling:wsdl:WebServicesProfile-Definitions-4.0" xmlns:ns16="com.journaltech.niem.test" xmlns:ns2="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CommonTypes-4.0" xmlns:ns3="http://niem.gov/niem/domains/jxdm/4.0" xmlns:ns4="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CivilCase-4.0" xmlns:ns5="urn:com.journaltech:ecourt:ecf:extension:CivilCaseTypeExt" xmlns:ns6="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CoreFilingMessage-4.0" xmlns:ns7="urn:un:unece:uncefact:data:specification:UnqualifiedDataTypesSchemaModule:2" xmlns:ns8="urn:com.journaltech:ecourt:ecf:extension:DocumentValue" xmlns:ns9="urn:com.journaltech:ecourt:ecf:extension:DocumentFilingMetaData" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <SOAP-ENV:Header />
   <SOAP-ENV:Body>
      <ns15:ReviewFilingRequestMessage>
         <ns2:SendingMDELocationID>
            <ns1:IdentificationID>YOUR_ENDPOINT_HERE</ns1:IdentificationID>
            <ns1:IdentificationSourceText>PLA</ns1:IdentificationSourceText>
         </ns2:SendingMDELocationID>
         <ns6:CoreFilingMessage xsi:type="ns11:CoreFilingMessageExtType">
            <ns1:DocumentFiledDate id="ref1">
               <ns1:DateTime>2021-02-19T12:25:56-08:00</ns1:DateTime>
            </ns1:DocumentFiledDate>
            <ns1:DocumentIdentification>
               <ns1:IdentificationID>YOUR_IDENTIFICATIONID_HERE</ns1:IdentificationID>
            </ns1:DocumentIdentification>
            <ns1:Case xsi:type="ns5:CivilCaseTypeExt">
               <ns1:CaseDocketID>S-DR-0058462</ns1:CaseDocketID>
               <ns5:Complaint xmlns:st="http://niem.gov/niem/structures/2.0" st:id="1109405" />
               <ns5:Complaint xmlns:st="http://niem.gov/niem/structures/2.0" st:id="1109405" />
               <ns5:CaseAugmentationExt>
                  <ns3:CaseCourt>
                     <ns1:OrganizationIdentification>
                        <ns1:IdentificationID>efm-placer-court-prod.ecourt.com</ns1:IdentificationID>
                        <ns1:IdentificationSourceText>PLA</ns1:IdentificationSourceText>
                     </ns1:OrganizationIdentification>
                     <ns3:CourtName>Placer County Superior Court</ns3:CourtName>
                  </ns3:CaseCourt>
               </ns5:CaseAugmentationExt>
            </ns1:Case>
            <ns6:FilingLeadDocument xmlns:st="http://niem.gov/niem/structures/2.0" complaintType="1109405" st:id="doc0" xsi:type="ns11:DocumentExtType">
               <ns1:DocumentBinary>
                  <ns1:BinaryFormatStandardName xsi:type="ns7:TextType">application/pdf</ns1:BinaryFormatStandardName>
                  <ns1:BinaryLocationURI>YOUR_URL_HERE</ns1:BinaryLocationURI>
               </ns1:DocumentBinary>
               <ns1:DocumentDescriptionText>201308</ns1:DocumentDescriptionText>
               <ns1:DocumentFileControlID>5197</ns1:DocumentFileControlID>
               <ns1:DocumentIdentification>
                  <ns1:IdentificationID>201308</ns1:IdentificationID>
                  <ns1:IdentificationSourceText>PLA</ns1:IdentificationSourceText>
               </ns1:DocumentIdentification>
               <ns9:DocumentFilingMetaData>
                  <ns9:documentFilingMetaDataItem>
                     <ns9:docValueMetaDataItem>
                        <ns8:code>FILING_PARTY</ns8:code>
                        <ns8:classType>caseParticipant</ns8:classType>
                        <ns8:subType>filed-by</ns8:subType>
                        <ns8:valueRestriction>existing-data</ns8:valueRestriction>
                     </ns9:docValueMetaDataItem>
                     <ns9:idReferences>
                        <ns9:id>1494948</ns9:id>
                        <ns9:additionalInfoTags>
                           <ns9:tagType>E_SERVICE</ns9:tagType>
                           <ns9:tagValue>1</ns9:tagValue>
                        </ns9:additionalInfoTags>
                        <ns9:additionalInfoTags>
                           <ns9:tagType>EFSP_EMAIL</ns9:tagType>
                           <ns9:tagValue>EMAIL_VALUE_HERE</ns9:tagValue>
                        </ns9:additionalInfoTags>
                     </ns9:idReferences>
                  </ns9:documentFilingMetaDataItem>
                  <ns9:documentFilingMetaDataItem>
                     <ns9:docValueMetaDataItem>
                        <ns8:code>FILING_PARTY_ADDRESS</ns8:code>
                        <ns8:classType>contact</ns8:classType>
                     </ns9:docValueMetaDataItem>
                     <ns9:contactValue>
                        <ns10:address1>141 Rainbow Dr #4146</ns10:address1>
                        <ns10:city>Livingston</ns10:city>
                        <ns10:zip>77399</ns10:zip>
                        <ns10:state>TX</ns10:state>
                        <ns10:country>US</ns10:country>
                        <ns10:telephoneType>BUS</ns10:telephoneType>
                        <ns10:telephoneNumber>7705439270</ns10:telephoneNumber>
                        <ns10:email>EMAIL_VALUE_HERE</ns10:email>
                        <ns10:addressType>BUS</ns10:addressType>
                     </ns9:contactValue>
                  </ns9:documentFilingMetaDataItem>
               </ns9:DocumentFilingMetaData>
            </ns6:FilingLeadDocument>
            <ns6:FilingConnectedDocument xmlns:st="http://niem.gov/niem/structures/2.0" complaintType="1109405" st:id="doc1" xsi:type="ns11:DocumentExtType">
               <ns1:DocumentBinary>
                  <ns1:BinaryFormatStandardName xsi:type="ns7:TextType">application/pdf</ns1:BinaryFormatStandardName>
                  <ns1:BinaryLocationURI>YOUR_URL_HERE</ns1:BinaryLocationURI>
               </ns1:DocumentBinary>
               <ns1:DocumentDescriptionText>201268</ns1:DocumentDescriptionText>
               <ns1:DocumentFileControlID>5198</ns1:DocumentFileControlID>
               <ns1:DocumentIdentification>
                  <ns1:IdentificationID>201268</ns1:IdentificationID>
                  <ns1:IdentificationSourceText>PLA</ns1:IdentificationSourceText>
               </ns1:DocumentIdentification>
               <ns9:DocumentFilingMetaData>
                  <ns9:documentFilingMetaDataItem>
                     <ns9:docValueMetaDataItem>
                        <ns8:code>CUSTODY_ISSUE</ns8:code>
                        <ns8:classType>boolean</ns8:classType>
                     </ns9:docValueMetaDataItem>
                     <ns9:booleanValue>true</ns9:booleanValue>
                  </ns9:documentFilingMetaDataItem>
                  <ns9:documentFilingMetaDataItem>
                     <ns9:docValueMetaDataItem>
                        <ns8:code>FILING_PARTY</ns8:code>
                        <ns8:classType>caseParticipant</ns8:classType>
                        <ns8:subType>filed-by</ns8:subType>
                        <ns8:valueRestriction>existing-data</ns8:valueRestriction>
                     </ns9:docValueMetaDataItem>
                     <ns9:idReferences>
                        <ns9:id>1494948</ns9:id>
                     </ns9:idReferences>
                  </ns9:documentFilingMetaDataItem>
               </ns9:DocumentFilingMetaData>
            </ns6:FilingConnectedDocument>
         </ns6:CoreFilingMessage>
      <ns12:PaymentMessage xsi:type="ns14:PaymentMessageTypeExt">
        <ns14:paymentAuthorizationInfo>
          <ns14:customerProfileId>0</ns14:customerProfileId>
          <ns14:customerPaymentProfileId>0</ns14:customerPaymentProfileId>
          <ns14:paymentType>ACH</ns14:paymentType>
        </ns14:paymentAuthorizationInfo>
      </ns12:PaymentMessage>
      </ns15:ReviewFilingRequestMessage>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>